app/views/category/show.html.erb

      <div class="col-md-9 prdt-left">
        <% if !@category.products.empty? %>
---
SELECT  1 AS one FROM "products" WHERE "products"."category_id" = $1 LIMIT $2  [["category_id", 726], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 726]]