app/controllers/api/v1/products_controller.rb

SELECT  "products".* FROM "products" LIMIT $1  [["LIMIT", 5]]
---
      def index
        @products = Product.all.limit(5)